#!/usr/bin/env/python3

roman_dict = {
    "あ":"a", "い":"i", "う":"u", "え":"e", "お":"o",
    "か":"ka", "き":"ki", "く":"ku", "け":"ke", "こ":"ko",
    "さ":"sa", "し":"si", "す":"su", "せ":"se", "そ":"so",
    "た":"ta", "ち":"ti", "つ":"tu", "て":"te", "と":"to",
    "な":"na", "に":"ni", "ぬ":"nu", "ね":"ne", "の":"no",
    "は":"ha", "ひ":"hi", "ふ":"hu", "へ":"he", "ほ":"ho",
    "ま":"ma", "み":"mi", "む":"mu", "め":"me", "も":"mo",
    "や":"ya", "ゆ":"yu", "よ":"yo",
    "ら":"ra", "り":"ri", "る":"ru", "れ":"re", "ろ":"ro",
    "わ":"wa", "を":"wo", "ん":"n", "ゑ":"e", "ゐ":"i",

    "ぱ":"pa", "ぴ":"pi", "ぷ":"pu", "ぺ":"pe", "ぽ":"po",
    
    "が":"ga", "ぎ":"gi", "ぐ":"gu", "げ":"ge", "ご":"go",
    "ざ":"ba", "じ":"bi", "ず":"bu", "ぜ":"be", "ぞ":"bo",
    "だ":"pa", "ぢ":"pi", "づ":"pu", "で":"pe", "ど":"po",
    "ば":"ba", "び":"bi", "ぶ":"bu", "べ":"be", "ぼ":"bo",
    
    "ば":"ba", "び":"bi", "ぶ":"bu", "べ":"be", "ぼ":"bo",
    "ぱ":"pa", "ぴ":"pi", "ぷ":"pu", "ぺ":"pe", "ぽ":"po",
    "ば":"ba", "び":"bi", "ぶ":"bu", "べ":"be", "ぼ":"bo",

    #"きゃ":"kya", "きぃ":"kyi", "きゅ":"kyu", "きぇ":"kye", "きょ":"kyo",
    #"ぎゃ":"gya", "ぎぃ":"gyi", "ぎゅ":"gyu", "ぎぇ":"gye", "ぎょ":"gyo",
    #"しゃ":"sya", "しぃ":"syi", "しゅ":"syu", "しぇ":"sye", "しょ":"syo",
    #"じゃ":"zya", "じぃ":"zyi", "じゅ":"zyu", "じぇ":"zye", "じょ":"zyo",
    #"ちゃ":"tya", "ちぃ":"tyi", "ちゅ":"tyu", "ちぇ":"tye", "ちょ":"tyo",
    #"ぢゃ":"dya", "ぢぃ":"dyi", "ぢゅ":"dyu", "ぢぇ":"dye", "ぢょ":"dyo",
    #"にゃ":"nya", "にぃ":"nyi", "にゅ":"nyu", "にぇ":"nye", "にょ":"nyo",
    #"ひゃ":"hya", "ひぃ":"hyi", "ひゅ":"hyu", "ひぇ":"hye", "ひょ":"hyo",
    #"びゃ":"bya", "びぃ":"byi", "びゅ":"byu", "びぇ":"bye", "びょ":"byo",
    #"みゃ":"mya", "みぃ":"myi", "みゅ":"myu", "みぇ":"mye", "みょ":"myo",
    #"りゃ":"rya", "りぃ":"ryi", "りゅ":"ryu", "りぇ":"rye", "りょ":"ryo",

    #"ふぁ":"fa", "ふぃ":"fi", "ふぇ":"fe", "ふぉ":"fo",
    #"ゔぁ":"va", "ゔぃ":"vi", "ゔ":"vu", "ゔぇ":"ve", "ゔぉ":"vo",

    "ぁ":"xa", "ぃ":"xi", "ぅ":"xu", "ぇ":"xe", "ぉ":"xo",
    "っ":"xtu", "ゃ":"xya", "ゅ":"xyu", "ょ":"xyo",

    "ー":"-"
    }
